particle-iot/device-os/platform/MCU/nRF52840/inc/platform_config.h
/**
  Copyright (c) 2013-2018 Particle Industries, Inc.  All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation, either
  version 3 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PLATFORM_CONFIG_H
#define __PLATFORM_CONFIG_H

#include "platforms.h"

// STM32 Device electronic signature
// Factory-programmed 12 byte unique device ID
#define         ID1          (0x1FFF7A10)
#define         ID2          (0x1FFF7A14)
#define         ID3          (0x1FFF7A18)

#ifndef PLATFORM_ID
#error "PLATFORM_ID not defined"
#endif

#include "nrf52840.h"
#include "nrfx_types.h"
#include "nrf_gpio.h"
#include "nrf_gpiote.h"
#include "nrf_rtc.h"

//LEDs
// TODO - map to Xenon hardware
#define LEDn                                4
#define LED_MIRROR_SUPPORTED                1
#define LED1_GPIO_AF_TIM                    0                       //User Led
#define LED1_GPIO_PIN                       GPIO_Pin_13             //User Led
#define LED1_GPIO_PIN_SOURCE                GPIO_PinSource13        //User Led
#define LED1_GPIO_PORT                      GPIOA                   //User Led
#define LED1_GPIO_CLK                       RCC_AHB1Periph_GPIOA    //User Led
#define LED1_GPIO_MODE                      GPIO_Mode_OUT           //User Led
#define LED_BLUE                            LED2
#define LED2_GPIO_AF_TIM                    GPIO_AF_TIM2            //BLUE Led
#define LED2_GPIO_PIN                       GPIO_Pin_3              //BLUE Led
#define LED2_GPIO_PIN_SOURCE                GPIO_PinSource3         //BLUE Led
#define LED2_GPIO_PORT                      GPIOA                   //BLUE Led
#define LED2_GPIO_CLK                       RCC_AHB1Periph_GPIOA    //BLUE Led
#define LED2_GPIO_MODE                      GPIO_Mode_AF            //BLUE Led
#define LED_RED                             LED3
#define LED3_GPIO_AF_TIM                    GPIO_AF_TIM2            //RED Led
#define LED3_GPIO_PIN                       GPIO_Pin_1              //RED Led
#define LED3_GPIO_PIN_SOURCE                GPIO_PinSource1         //RED Led
#define LED3_GPIO_PORT                      GPIOA                   //RED Led
#define LED3_GPIO_CLK                       RCC_AHB1Periph_GPIOA    //RED Led
#define LED3_GPIO_MODE                      GPIO_Mode_AF            //RED Led
#define LED_GREEN                           LED4
#define LED4_GPIO_AF_TIM                    GPIO_AF_TIM2            //GREEN Led
#define LED4_GPIO_PIN                       GPIO_Pin_2              //GREEN Led
#define LED4_GPIO_PIN_SOURCE                GPIO_PinSource2         //GREEN Led
#define LED4_GPIO_PORT                      GPIOA                   //GREEN Led
#define LED4_GPIO_CLK                       RCC_AHB1Periph_GPIOA    //GREEN Led
#define LED4_GPIO_MODE                      GPIO_Mode_AF            //GREEN Led

//Push Buttons
#define BUTTONn                             1
#define BUTTON1_GPIO_PIN                    11
#define BUTTON1_GPIO_MODE                   NRF_GPIO_PIN_DIR_INPUT
#define BUTTON1_GPIO_PUPD                   NRF_GPIO_PIN_PULLUP
#define BUTTON1_PRESSED                     0x00
#define BUTTON1_GPIOTE_EVENT_IN             NRF_GPIOTE_EVENTS_IN_0
#define BUTTON1_GPIOTE_EVENT_CHANNEL        0
#define BUTTON1_GPIOTE_INT_MASK             NRF_GPIOTE_INT_IN0_MASK
#define BUTTON1_GPIOTE_IRQn                 GPIOTE_IRQn
#define BUTTON1_GPIOTE_IRQ_HANDLER          GPIOTE_IRQHandler
#define BUTTON1_GPIOTE_IRQ_PRIORITY         7
#define BUTTON1_GPIOTE_IRQ_INDEX            22
#define BUTTON1_GPIOTE_TRIGGER              NRF_GPIOTE_POLARITY_HITOLO
#define BUTTON1_MIRROR_SUPPORTED            0

#define UI_TIMER_FREQUENCY                  100    /* 100Hz -> 10ms */
#define BUTTON_DEBOUNCE_INTERVAL            1000 / UI_TIMER_FREQUENCY

// todo - add this later #define FLASH_UPDATE_MODULES

//NVIC Priorities based on NVIC_PriorityGroup_4
#define SDIO_IRQ_PRIORITY                   0       //??? BCM43362 SDIO Interrupt
#ifdef USE_USB_OTG_FS
#define OTG_FS_IRQ_PRIORITY                 2       //USB OTG FS Interrupt
#define OTG_FS_WKUP_IRQ_PRIORITY            2       //USB OTG FS Wakeup Interrupt
#elif defined USE_USB_OTG_HS
#define OTG_HS_EP1_IN_IRQ_PRIORITY          2       //USB OTG HS EP1 IN Interrupt
#define OTG_HS_EP1_OUT_IRQ_PRIORITY         2       //USB OTG HS EP1 OUT Interrupt
#define OTG_HS_IRQ_PRIORITY                 2       //USB OTG HS Interrupt
#define OTG_HS_WKUP_IRQ_PRIORITY            2       //USB OTG HS Wakeup Interrupt
#endif
#define RTC_Alarm_IRQ_PRIORITY              3       //RTC Alarm Interrupt
#define RTC_WKUP_IRQ_PRIORITY               4       //RTC Seconds Interrupt
#define USART1_IRQ_PRIORITY                 5       //USART1 Interrupt
#define USART2_IRQ_PRIORITY                 5       //USART2 Interrupt
#define RTC0_IRQ_PRIORITY                   5       //RTC0 Interrupt
#define SYSTICK_IRQ_PRIORITY                13      //CORTEX_M3 Systick Interrupt
#define SVCALL_IRQ_PRIORITY                 14      //CORTEX_M3 SVCall Interrupt
#define PENDSV_IRQ_PRIORITY                 15      //CORTEX_M3 PendSV Interrupt

#define PREPSTRING2(x) #x
#define PREPSTRING(x) PREPSTRING2(x)

#if PLATFORM_ID == PLATFORM_XENON
    #define INTERNAL_FLASH_SIZE             (0x100000)
#else
    #pragma message "PLATFORM_ID is " PREPSTRING(PLATFORM_ID)
    #error "Unknown PLATFORM_ID"
#endif

/* Exported functions ------------------------------------------------------- */

#endif /* __PLATFORM_CONFIG_H */


